[TOC]
# MYSQL 学习笔记
## 初级
## DML
### 1. 连接mysql

学习参考1：http://www.codedata.com.tw/tag/mysql/4

```shell
mysql -h localhost -u 用户名 -p 密码
mysql -h localhost -u root -p root
```

### 2.1 创建数据库

```mysql
create database 数据库名;
create database db1;

```

### 2.1 查看数据库

```mysql
show databases;
```

### 3 选中创建的数据库

```mysql
use 数据库名
use db1
```

### 4.1创建数据表

```mysql
create table 数据表名 (
    字段1 字段数据类型 字段其他属性，
    字段2 字段数据类型 字段其他属性，
    ...
    字段N 字段数据类型 字段其他属性

) 数据库引擎类型，数据表字符设定字段;

create table test(
    id int(10) not null auto_increment primary key ,
    name varchar(50),
    age int(10)
) engine = 'innodb' charset = 'utf8';
```

### 4.2 查看数据表

```mysql
show tables;
```

### 4.3 查看表结构

```mysql
describe tablename;
describe test;
```

### 5 insert 操作

```mysql
insert [into] 表名 [(列名1, 列名2, 列名3, ...)] values (值1, 值2, 值3, ...);
insert into test(id,name,age) values(1, "王刚", 20);
```

### 6 update 操作

```mysql
update 表名称 set 列名称=新值 where 更新条件;
update test set name="李刚" where id=1;
```

### 7 delete 操作

```mysql
delete from 表名称 where 删除条件;
delete from test where id=1;
```

### 8 select
条件表达式
where 关系运算符 <, >, =, <=, >=, !=; not,or,and

where in 取出枚举数

where btween and 取出范围

```mysql
select 列名称 from 表名称 [查询条件];
select name,age from test where id = 1;
```

### 9 理解查询模型

查询语句中列名相当于变量，通过where语句核对条件中的值和变量的值对比，为真则取出。

列是变量，变量可以计算，因此列名可以做计算

取列也叫投影

列运算后取出叫广义投影

```mysql
select * from user where 1; 
```
取出表中全部的值

### 10 NULL介绍

```
```

### 11 GROUP BY分组与统计函数
统计函数：
max() 最大值、
min() 最小值、
count() 计数、
avg() 平均值、
sum() 求和

```mysql
select 列名称 from 表名称 [查询条件] group by [分组条件];


```

### 12 having 筛选

```mysql
select 列名称 from 表名称 [查询条件] group by [分组条件] having [筛选条件];
```

### 13 ORDER BY 排序

```mysql
select 列名 from 表名 order by 列名; 
select name from test order by age;
```

### 14 LIMIT 用法

```mysql
select * from 表名 limit 起始行,偏移量
select * from test limit 0,2; 

```

### 15 子句查询的陷阱
子句查询必须按顺序  where-->group by--> having--> order by--> limit 
否则出错

```mysql

```

### 16 WHERE 型子句
where子句后面的嵌套select子句

```mysql
select 列名 from 表名 where 列名=(select ...)

```

### 17 FROM 型子句

```mysql

```
#[img] http://segmentfault.com/img/bVb5ap

### 18 EXISTS 型子句

```mysql

```

### 19 连接查询

ref = http://www.cnblogs.com/BeginMan/p/3754322.html

+ Join语法概述

    join 用于多表中字段之间的联系，语法如下：

```mysql
... FROM table1 INNER|LEFT|RIGHT JOIN table2 ON conditiona
```
    table1:左表；table2:右表。

    JOIN 按照功能大致分为如下三类：

    INNER JOIN（内连接,或等值连接）：取得两个表中存在连接匹配关系的记录。

    LEFT JOIN（左连接）：取得左表（table1）完全记录，即是右表（table2）并无对应匹配记录。

    RIGHT JOIN（右连接）：与 LEFT JOIN 相反，取得右表（table2）完全记录，即是左表（table1）并无匹配对应记录。

    注意：mysql不支持Full join,不过可以通过UNION 关键字来合并 LEFT JOIN 与 RIGHT JOIN来模拟FULL join.

### 以查询练习集中的表数据做示例

INNER JOIN 示例

内连接，也叫等值连接，inner join产生同时符合A和B的一组数据。

```mysql
select * from student inner join score on student.sno = score.sno;
```

```
+-----+-------+------+---------------------+-------+-----+-------+--------+
| sno | sname | ssex | sbirthday           | class | sno | cno   | degree |
+-----+-------+------+---------------------+-------+-----+-------+--------+
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-245 |     86 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 3-245 |     75 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 3-245 |     68 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-105 |     92 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 3-105 |     88 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 3-105 |     76 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-105 |     64 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 3-105 |     91 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 3-105 |     78 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 6-166 |     85 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 6-166 |     79 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 6-166 |     81 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-245 |     86 |
+-----+-------+------+---------------------+-------+-----+-------+--------+
```

LEFT JOIN 示例

LEFT JOIN 左连接从左表产生一套完整的记录,与右匹配的记录 .如果没有匹配,右侧将包含null。

```mysql
 select * from student left join score on student.sno = score.sno;
 ```

```
+-----+-------+------+---------------------+-------+------+-------+--------+
| sno | sname | ssex | sbirthday           | class | sno  | cno   | degree |
+-----+-------+------+---------------------+-------+------+-------+--------+
| 101 | 李军  | 男   | 1976-02-20 00:00:00 | 95033 | NULL | NULL  |   NULL |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103  | 3-245 |     86 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103  | 3-105 |     92 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103  | 3-105 |     64 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103  | 6-166 |     85 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103  | 3-245 |     86 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105  | 3-245 |     75 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105  | 3-105 |     88 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105  | 3-105 |     91 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105  | 6-166 |     79 |
| 107 | 王丽  | 女   | 1976-01-23 00:00:00 | 95033 | NULL | NULL  |   NULL |
| 108 | 曾华  | 男   | 1977-09-01 00:00:00 | 95033 | NULL | NULL  |   NULL |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109  | 3-245 |     68 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109  | 3-105 |     76 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109  | 3-105 |     78 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109  | 6-166 |     81 |
+-----+-------+------+---------------------+-------+------+-------+--------+
```

RIGHT JOIN 示例

RIGHT JOIN 右连接从右表产生一套完整的记录,与左表匹配的记录 .如果没有匹配,右侧将包含null。

```mysql
select * from student right join score on student.sno = score.sno;
```

```
+------+-------+------+---------------------+-------+-----+-------+--------+
| sno  | sname | ssex | sbirthday           | class | sno | cno   | degree |
+------+-------+------+---------------------+-------+-----+-------+--------+
| 103  | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-245 |     86 |
| 105  | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 3-245 |     75 |
| 109  | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 3-245 |     68 |
| 103  | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-105 |     92 |
| 105  | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 3-105 |     88 |
| 109  | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 3-105 |     76 |
| 103  | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-105 |     64 |
| 105  | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 3-105 |     91 |
| 109  | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 3-105 |     78 |
| 103  | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 6-166 |     85 |
| 105  | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 | 105 | 6-166 |     79 |
| 109  | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 | 109 | 6-166 |     81 |
| 103  | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 | 103 | 3-245 |     86 |
+------+-------+------+---------------------+-------+-----+-------+--------+
```

```mysql


```

## 查询综合练习

### 一、设有一数据库，包括四个表：
学生表（student）、课程表（course）、成绩表（score）以及教师信息表（teacher）

用SQL语句创建四个表并完成相关题目

ref = http://www.cnblogs.com/aqxss/p/6563625.html (1-45)

建立学生信息表student

```mysql
create table student
(
sno varchar(20) not null primary key,
sname varchar(20) not null,
ssex varchar(20) not null,
sbirthday datetime,
class varchar(20)

);
```

student表结构

```text
+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| sno       | varchar(20) | NO   | PRI | NULL    |       |
| sname     | varchar(20) | NO   |     | NULL    |       |
| ssex      | varchar(20) | NO   |     | NULL    |       |
| sbirthday | datetime    | YES  |     | NULL    |       |
| class     | varchar(20) | YES  |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+
```

建立教师表teacher

```mysql
create table teacher
(
tno varchar(20) not null primary key,
tname varchar(20) not null,
tsex varchar(20) not null,
tbirthday datetime,
prof varchar(20),
depart varchar(20) not null

);
```

teacher表结构

```text
+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| tno       | varchar(20) | NO   | PRI | NULL    |       |
| tname     | varchar(20) | NO   |     | NULL    |       |
| tsex      | varchar(20) | NO   |     | NULL    |       |
| tbirthday | datetime    | YES  |     | NULL    |       |
| prof      | varchar(20) | YES  |     | NULL    |       |
| depart    | varchar(20) | NO   |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+

```

建立课程表course

```mysql
create table course
(
cno varchar(20) not null primary key,
cname varchar(20) not null,
tno varchar(20) not null,
foreign key(tno) references teacher(tno)

);
```

course表结构

```text
+-------+-------------+------+-----+---------+-------+
| Field | Type        | Null | Key | Default | Extra |
+-------+-------------+------+-----+---------+-------+
| cno   | varchar(20) | NO   | PRI | NULL    |       |
| cname | varchar(20) | NO   |     | NULL    |       |
| tno   | varchar(20) | NO   | MUL | NULL    |       |
+-------+-------------+------+-----+---------+-------+
```

建立成绩表

```mysql
create table score
(
sno varchar(20) not null,
foreign key(sno) references student(sno),
cno varchar(20) not null,
foreign key(cno) references course(cno),
degree decimal

);
```

score表结构

```text
+--------+---------------+------+-----+---------+-------+
| Field  | Type          | Null | Key | Default | Extra |
+--------+---------------+------+-----+---------+-------+
| sno    | varchar(20)   | NO   | MUL | NULL    |       |
| cno    | varchar(20)   | NO   | MUL | NULL    |       |
| degree | decimal(10,0) | YES  |     | NULL    |       |
+--------+---------------+------+-----+---------+-------+
```

添加学生信息

```mysql
insert into student values('108','曾华','男','1977-09-01','95033');
insert into student values('105','匡明','男','1975-10-02','95031');
insert into student values('107','王丽','女','1976-01-23','95033');
insert into student values('101','李军','男','1976-02-20','95033');
insert into student values('109','王芳','女','1975-02-10','95031');
insert into student values('103','陆君','男','1974-06-03','95031');

```

添加教师信息

```mysql
insert into teacher values('804','李诚','男','1958-12-02','副教授','计算机系');
insert into teacher values('856','张旭','男','1969-03-12','讲师','电子工程系');
insert into teacher values('825','王萍','女','1972-05-05','助教','计算机系');
insert into teacher values('831','刘冰','女','1977-08-14','助教','电子工程系');

```

添加课程信息

```mysql
insert into course values('3-105','计算机导论','825');
insert into course values('3-245','操作系统','804');
insert into course values('6-166','数字电路','856');
insert into course values('9-888','高等数学','831');
```

添加成绩信息

```mysql
insert into score values('103','3-245','86');
insert into score values('105','3-245','75');
insert into score values('109','3-245','68');
insert into score values('103','3-105','92');
insert into score values('105','3-105','88');
insert into score values('109','3-105','76');
insert into score values('103','3-105','64');
insert into score values('105','3-105','91');
insert into score values('109','3-105','78');
insert into score values('103','6-166','85');
insert into score values('105','6-166','79');
insert into score values('109','6-166','81');
```

### 问题集
Q1、 查询Student表中的所有记录的Sname、Ssex和Class列

```mysql
select sname,ssex,class from student;
```

```text
+-------+------+-------+
| sname | ssex | class |
+-------+------+-------+
| 李军  | 男   | 95033 |
| 陆君  | 男   | 95031 |
| 匡明  | 男   | 95031 |
| 王丽  | 女   | 95033 |
| 曾华  | 男   | 95033 |
| 王芳  | 女   | 95031 |
+-------+------+-------+

```

Q2、查询教师所有的单位即不重复的Depart列

```mysql
select distinct depart from teacher;
```

```text
+------------+
| depart     |
+------------+
| 计算机系   |
| 电子工程系 |
+------------+
```

Q3、 查询Student表的所有记录

```mysql
select * from student;
```

```text
+-----+-------+------+---------------------+-------+
| sno | sname | ssex | sbirthday           | class |
+-----+-------+------+---------------------+-------+
| 101 | 李军  | 男   | 1976-02-20 00:00:00 | 95033 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 |
| 107 | 王丽  | 女   | 1976-01-23 00:00:00 | 95033 |
| 108 | 曾华  | 男   | 1977-09-01 00:00:00 | 95033 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 |
+-----+-------+------+---------------------+-------+
```

Q4、查询Score表中成绩在60到80之间的所有记录

```mysql
select * from score where degree between 60 and 80;
```

```text
+-----+-------+--------+
| sno | cno   | degree |
+-----+-------+--------+
| 105 | 3-245 |     75 |
| 109 | 3-245 |     68 |
| 109 | 3-105 |     76 |
| 103 | 3-105 |     64 |
| 109 | 3-105 |     78 |
| 105 | 6-166 |     79 |
+-----+-------+--------+

```

Q5、查询Score表中成绩为85，86或88的记录

```mysql
select * from Score where Degree in(85,86,88);
```

```text
+-----+-------+--------+
| sno | cno   | degree |
+-----+-------+--------+
| 103 | 3-245 |     86 |
| 105 | 3-105 |     88 |
| 103 | 6-166 |     85 |
| 103 | 3-245 |     86 |
+-----+-------+--------+

```

Q6、查询Student表中“95031”班或性别为“女”的同学记录

```mysql
select * from student where class = '95031' or ssex = '女';
```

```text
+-----+-------+------+---------------------+-------+
| sno | sname | ssex | sbirthday           | class |
+-----+-------+------+---------------------+-------+
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 |
| 107 | 王丽  | 女   | 1976-01-23 00:00:00 | 95033 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 |
+-----+-------+------+---------------------+-------+
```

Q7、以Class降序查询Student表的所有记录

```mysql
select * from student order by class desc;
```

```text
+-----+-------+------+---------------------+-------+
| sno | sname | ssex | sbirthday           | class |
+-----+-------+------+---------------------+-------+
| 101 | 李军  | 男   | 1976-02-20 00:00:00 | 95033 |
| 107 | 王丽  | 女   | 1976-01-23 00:00:00 | 95033 |
| 108 | 曾华  | 男   | 1977-09-01 00:00:00 | 95033 |
| 103 | 陆君  | 男   | 1974-06-03 00:00:00 | 95031 |
| 105 | 匡明  | 男   | 1975-10-02 00:00:00 | 95031 |
| 109 | 王芳  | 女   | 1975-02-10 00:00:00 | 95031 |
+-----+-------+------+---------------------+-------+

```

Q8、以Cno升序、Degree降序查询Score表的所有记录

```mysql
select * from Score order by cno asc,degree desc;
```

```text
+-----+-------+--------+
| sno | cno   | degree |
+-----+-------+--------+
| 103 | 3-105 |     92 |
| 105 | 3-105 |     91 |
| 105 | 3-105 |     88 |
| 109 | 3-105 |     78 |
| 109 | 3-105 |     76 |
| 103 | 3-105 |     64 |
| 103 | 3-245 |     86 |
| 103 | 3-245 |     86 |
| 105 | 3-245 |     75 |
| 109 | 3-245 |     68 |
| 103 | 6-166 |     85 |
| 109 | 6-166 |     81 |
| 105 | 6-166 |     79 |
+-----+-------+--------+
```

Q9、查询“95031”班的学生人数

```mysql
 select count(*) from student where class = '95031';
```

```text
+----------+
| count(*) |
+----------+
|        3 |
+----------+
```

Q10、查询Score表中的最高分的学生学号和课程号。（子查询或者排序）

```mysql
select sno,cno from score where degree = (select max(degree) from score);
select sno,cno from score order by degree desc limit 0,1;
```

```text
+-----+-------+
| sno | cno   |
+-----+-------+
| 103 | 3-105 |
+-----+-------+
```

Q11、查询每门课的平均成绩

```mysql
select cno,avg(degree) from score group by cno;
```

```text
+-------+-------------+
| cno   | avg(degree) |
+-------+-------------+
| 3-105 |     81.5000 |
| 3-245 |     78.7500 |
| 6-166 |     81.6667 |
+-------+-------------+

```

Q12、查询Score表中至少有5名学生选修的并以3开头的课程的平均分数

```mysql
select avg(Degree) from score where Cno like '3%' and Cno in (select Cno from score group by Cno having count(*)>=5) ;
# 用in 不用= 是因为可能会有多个
# 简单写法：
select avg(degree) from score where cno like '3%' group by cno having count(sno)>=5;
```
+ 知识点：

    group by 列名：以某一列为依据做分组统计
    
    having 条件表达式：按条件筛选出符合要求的数据

```text
+-------------+
| avg(Degree) |
+-------------+
|     81.5000 |
+-------------+
```

Q13、查询分数大于70，小于90的sno列

```mysql
select Sno from Score where degree between 70 and 90;
```

```text

+-----+--------+
| sno | degree |
+-----+--------+
| 103 |     86 |
| 105 |     75 |
| 105 |     88 |
| 109 |     76 |
| 109 |     78 |
| 103 |     85 |
| 105 |     79 |
| 109 |     81 |
| 103 |     86 |
+-----+--------+
```

Q14、查询所有学生的Sname、Cno和Degree列

```mysql
 select sname,cno,degree from student,score where student.sno = score.sno;
```
+ 知识点

    按where 条件从两张表中查询数据

```
+-------+-------+--------+
| sname | cno   | degree |
+-------+-------+--------+
| 陆君  | 3-245 |     86 |
| 匡明  | 3-245 |     75 |
| 王芳  | 3-245 |     68 |
| 陆君  | 3-105 |     92 |
| 匡明  | 3-105 |     88 |
| 王芳  | 3-105 |     76 |
| 陆君  | 3-105 |     64 |
| 匡明  | 3-105 |     91 |
| 王芳  | 3-105 |     78 |
| 陆君  | 6-166 |     85 |
| 匡明  | 6-166 |     79 |
| 王芳  | 6-166 |     81 |
| 陆君  | 3-245 |     86 |
+-------+-------+--------+
```

Q15、查询所有学生的Sno、Cname和Degree列

```mysql
select sno,cname,degree from score,course where score.cno = course.cno;
```

```
+-----+------------+--------+
| sno | cname      | degree |
+-----+------------+--------+
| 103 | 计算机导论 |     92 |
| 105 | 计算机导论 |     88 |
| 109 | 计算机导论 |     76 |
| 103 | 计算机导论 |     64 |
| 105 | 计算机导论 |     91 |
| 109 | 计算机导论 |     78 |
| 103 | 操作系统   |     86 |
| 105 | 操作系统   |     75 |
| 109 | 操作系统   |     68 |
| 103 | 操作系统   |     86 |
| 103 | 数字电路   |     85 |
| 105 | 数字电路   |     79 |
| 109 | 数字电路   |     81 |
+-----+------------+--------+
```

Q16、查询所有学生的Sname、Cname和Degree列

```mysql
select sname,cname,degree from student,course,score where student.sno = score.sno and course.cno = score.cno;
#inner join .. on 写法：
select sname,cname,degree from student inner join score on student.sno = score.sno inner join course on course.cno = score.cno;
```
知识点：
inner join 用法：(inner可以省略）
```mysql
select 表明.列名，[表明.列名] ... from 表名 inner join 表名 on 条件
```

```
+-------+------------+--------+
| sname | cname      | degree |
+-------+------------+--------+
| 陆君  | 操作系统   |     86 |
| 匡明  | 操作系统   |     75 |
| 王芳  | 操作系统   |     68 |
| 陆君  | 计算机导论 |     92 |
| 匡明  | 计算机导论 |     88 |
| 王芳  | 计算机导论 |     76 |
| 陆君  | 计算机导论 |     64 |
| 匡明  | 计算机导论 |     91 |
| 王芳  | 计算机导论 |     78 |
| 陆君  | 数字电路   |     85 |
| 匡明  | 数字电路   |     79 |
| 王芳  | 数字电路   |     81 |
| 陆君  | 操作系统   |     86 |
+-------+------------+--------+
```

Q17、查询“95033”班学生的平均分

```mysql
 select avg(score.degree) as "class:95033" from student,score where student.class = "95033";　
```

```
+-------------+
| class:95033 |
+-------------+
|     80.6923 |
+-------------+
```

Q18、 假设使用如下命令建立了一个grade表

```mysql
create table grade(low  int(3),upp  int(3),rank  char(1))

insert into grade values(90,100,’A’)

insert into grade values(80,89,’B’)

insert into grade values(70,79,’C’)

insert into grade values(60,69,’D’)

insert into grade values(0,59,’E’)
```

现查询所有分数在low与upp之间的同学的Sno、Cno和rank列

```mysql
select Sno,Cno,rank from Score,grade where degree between low and upp
```

Q19、查询选修“3-105”课程的成绩高于“109”号同学成绩的所有同学的记录

```mysql
--109同学，选修是3-105课的</span>
select * from score where Cno='3-105' and degree>(select max(degree ) from Score where Sno='109' and Cno='3-105' );
--109同学，没有选修3-105课</span>
select * from score where Cno='3-105' and degree>(select max(degree ) from Score where Sno='109')
and degree<( select max(degree ) from Score where sno in (select Sno from score group by Sno having count(*)>1));
```

```
--109同学，选修是3-105课的
+-----+-------+--------+
| sno | cno   | degree |
+-----+-------+--------+
| 103 | 3-105 |     92 |
| 105 | 3-105 |     88 |
| 105 | 3-105 |     91 |
+-----+-------+--------+
--109同学，没有选修3-105课
+-----+-------+--------+
| sno | cno   | degree |
+-----+-------+--------+
| 105 | 3-105 |     88 |
| 105 | 3-105 |     91 |
+-----+-------+--------+
```

Q20、选了多门课程并且是这个课程下不是最高分的

```mysql
select * from score as a where sno in (select sno from score group by sno having count(*)>1) and degree<( select max(degree ) from score as b where b.cno = a.cno);
```
知识点：单表对照查询
通过重命名形成两张表，对表中的元组进行对照查询

```
+-----+-------+--------+
| sno | cno   | degree |
+-----+-------+--------+
| 105 | 3-245 |     75 |
| 109 | 3-245 |     68 |
| 105 | 3-105 |     88 |
| 109 | 3-105 |     76 |
| 103 | 3-105 |     64 |
| 105 | 3-105 |     91 |
| 109 | 3-105 |     78 |
| 105 | 6-166 |     79 |
| 109 | 6-166 |     81 |
+-----+-------+--------+
```

Q21、查询 高于学号为“109”、课程号为“3-105”的成绩的所有记录

```mysql
select * from score where degree>(select degree from Score where sno='109' and cno='3-105' )
```

```
+-----+-------+--------+
| sno | cno   | degree |
+-----+-------+--------+
| 105 | 3-105 |     88 |
| 103 | 6-166 |     85 |
| 105 | 6-166 |     79 |
| 109 | 6-166 |     81 |
| 103 | 3-245 |     89 |
+-----+-------+--------+
```

Q22、查询和学号为108、101的同学同年出生的所有学生的Sno、Sname和Sbirthday列

```mysql
select sno,sname,sbirthday  from student where year(sbirthday) = (select year(sbirthday) from student where  sno='108')

select sno,sname,sbirthday  from student where year(sbirthday) = (select year(sbirthday) from student where  sno='101')
```

Q23、查询“张旭“教师任课的学生成绩

```mysql
select Sno,degree from score,Course  where score.Cno=Course.Cno and Course.Tno= (select Tno from Teacher where Tname='张旭' )

select degree from score where Cno in (select cno from course where Tno= (select Tno from Teacher where Tname='张旭'  ) )
```

Q24、查询选修某课程的同学人数多于5人的教师姓名

```mysql
select Tname from Teacher,  Course where Teacher.Tno=Course.Tno and Course.Cno =(select Cno from Score group by Cno having count(*)>5)
1
select Tname from Teacher where tno=( select Tno from Course where cno=( select Cno from Score group by Cno having count(*)>5 ))
```

Q25、查询95033班和95031班全体学生的记录

```mysql
select * from  student where  class in ('95033','95031')
```

Q26、查询存在有85分以上成绩的课程Cno

```mysql
select Cno from score where degree>85
```

Q27、查询出“计算机系“教师所教课程的成绩表

```mysql
select * from course  where cno in (select cno from course  where tno in (select tno from teacher where Depart='计算机系'))
```

Q28、查询“计算 机系”与“电子工程系“不同职称的教师的Tname和Prof

```mysql
select Tname,Prof from Teacher where Depart ='计算机系' and Prof  not in( select Prof from Teacher where Depart ='电子工程系')<br>union <br>select Tname,Prof from Teacher where Depart ='电子工程系' and Prof  not in( select Prof from Teacher where Depart ='计算机系')
```

Q29、查询选修编号为“3-105“课程且成绩至少高于选修编号为“3-245”的同学的Cno、Sno和Degree,并按Degree从高到低次序排序

any:代表括号中任意一个成绩就可以

```mysql
select Cno,Sno,Degree from score where cno='3-105' and degree >any(select degree from score where cno='3-245' ) order by degree desc
```

Q30、查询选修编号为“3-105”且成绩高于选修编号为“3-245”课程的同学的Cno、Sno和Degree

all:代表括号中的所有成绩

```mysql
select Cno,Sno,Degree from score where cno='3-105' and degree >all(select degree from score where cno='3-245' ) order by degree desc
```

Q31、查询所有教师和同学的name、sex和birthday

```mysql
select tname,tsex,tbirthday from Teacher union select sname,ssex,sbirthday from Student
```

Q32、查询所有“女”教师和“女”同学的name、sex和birthday

```mysql
select Tname,Tsex,Tbirthday from Teacher where Tsex='女' union select Sname,Ssex,Sbirthday from Student where Ssex='女'
```

Q33、查询成绩比该课程平均成绩低的同学的成绩表

```mysql
select * from score a  where degree < (select avg(degree) from score b where b.cno=a.cno)
```

Q34、查询所有任课教师的Tname和Depart

```mysql
select Tname,Depart from Teacher where tno in (select tno from course )
```

Q35、查询所有未讲课的教师的Tname和Depart

```mysql
select Tname,Depart from Teacher where Tno not in (select Tno from Course where cno in (select cno from score  ))
```

Q36、查询至少有2名男生的班号

```mysql
select class from student where ssex='男' group by class having count(*)>1
```

Q37、查询Student表中不姓“王”的同学记录

```mysql
select * from Student where Sname not  like '王%%'
```

Q38、查询Student表中每个学生的姓名和年龄

```mysql
select Sname, year(now())-year(sbirthday)  from Student
```

Q39、查询Student表中最大和最小的Sbirthday日期值

```mysql
select Max(Sbirthday ),Min(Sbirthday ) from Student
```

Q40、以班号和年龄从大到小的顺序查询Student表中的全部记录

```mysql
select * from Student  order by  class desc, Sbirthday
```

Q41、查询“男”教师及其所上的课程

```mysql
select Tname,Cname from course,teacher where course.tno= teacher.tno and teacher.Tsex='男'
```

Q42、查询最高分同学的Sno、Cno和Degree列

```mysql
select Sno,Cno,Degree from score where degree=(select max(degree) from score)

#排序写法：

select Sno,Cno,Degree from score order by degree desc limit 0,1
```

Q43、查询和“李军”同性别的所有同学的Sname

```mysql
select Sname from Student where Ssex = (select Ssex from Student where Sname='李军')
```

Q44、查询和“李军”同性别并同班的同学Sname

```mysql
select Sname from Student where Ssex = (select Ssex from Student where Sname='李军' ) and class=( select class from student where Sname='李军')
```

Q45、查询所有选修“计算机导论”课程的“男”同学的成绩表

```mysql
select  Sno,Cno,degree from score where Cno=( select Cno from course where Cname='计算机导论') and Sno in (select Sno from student where Ssex='男')

```

## DDL
### 24 建表过程

```mysql

```

### 25 整型列

```mysql

```

### 26 整型列的属性

```mysql

```

### 27 浮点列与定点列

```mysql

```

### 28 字符型列

```mysql

```

### 29 日期时间型列

```mysql

```

### 30 列的默认值

```mysql

```

### 31 主键与自增

```mysql

```

### 32 综合建表案例

```mysql

```

### 33 列的增删改

```mysql

```

### 34 视图VIEW
视图是表的一种映射，以sql语句的形式保持在数据库中
只有在视图和表数据一一对应时，视图的修改才对应表的修改。否则无效。
如使用聚合函数如求平均值后的视图

```mysql

```

### 35 视图ALGROITHM
视图算法有两种，
一种temptable
一种

```mysql


```

### 36 常用表管理

```mysql

```

### 37 存储引擎的概念

```mysql

```

### 38 字符集与乱码
在系统和数据库之间有一个转换器,把接收到的数据字符集转换为数据库存储的字符集，只要设置字符集是告知转换器正确的操作字符集即可。
如告知错误，则转换器按错误字符集转换后保存的也是错误的，因而出现乱码。

具体设置方法：
查看默认字符编码命令
```mysql
show variables like 'character%'; 
```
修改mysql安装路径下的my.ini文件，更改默认字符集，在文件中增加如下内容：
```mysql
[mysql]
default-character-set=utf8
[mysql.server]
default-character-set=utf8
[mysql_safe]
default-character-set=utf8
[client]
default-character-set=gbk
```
如果文件中已经存在，则修改，如果不存在，则添加。否则报错。
修改的目的是把 服务器端统一设置为utf8，客户端（CMD或GUI）设置为gbk.

```mysql

```

### 39 索引概念
索引相当于书的目录，主键是索引的一种。
还有两种索引，unique 索引和？

```mysql

```

### 40 索引操作语法

```mysql

```

### 41 常用函数
floor

```mysql

```

### 42 常用函数

```mysql

```

### 43 事务概念
事务特性：
原子性，一致性，持久性

原子性：操作要成功都成功，要失败都失败，如银行转账。
一致性：
持久性：一旦提交，操作信息将永久存在，不能删除。如ATM机取钱时，扣款后不吐钱，银行只能在数据库中更新扣掉的钱（重新加会原来的数），不能删除扣钱记录。

```mysql

```

## 高级
### 触发器

```mysql

```

### 触发器变量

```mysql

```

### 行变量

```mysql

```

### 触发器做简单编程

```mysql

```

### for each row 的作用

```mysql

```

### 存储过程概念

```mysql

```

### 引入变量与控制结构

```mysql

```

### 存储过程的参数传递

```mysql

```

### 过程中使用循环结构

```mysql

```

### 何为输出型参数

```mysql

```

### CASE结构的用法

```mysql

```

### REPEAT 循环结构

```mysql

```

### 游标的概念

```mysql

```

### 游标循环

```mysql

```

### DECLARE处理条件

```mysql

```

### 对比CONTINUE与EXIT的区别

```mysql

```

### 游标循环读取的正确逻辑

```mysql

```

### MySQL权限检查原理

```mysql

```

### 全局授权与收回

```mysql

```

### 库及表级别授权与收回

```mysql

```

### 主从配置过程

```mysql

```

### 启动主从

```mysql

```

```mysql

```

```mysql

```

```mysql

```

```mysql

```

```mysql

```

```mysql

```

```
```

```
```